from datetime import datetime


class ISODateConverter:
    """ Пользовательский конвертер маршрутов. """
    regex = r"\d{4}-\d{2}-\d{2}"  # захватываем часть строки формата YYYY-MM-DD
    # TODO добавить атрибут класса date_format, так как его значение будет использоваться в двух методах

    def to_python(self, value: str):
        """ Метод обрабатывает захваченную регуляркой строку в python тип, который должен быть передан Django View. """
        return datetime.strptime(value, '%Y-%m-%d')  # TODO вынести формат даты в отдельный атрибут класса

    # TODO записать метод, который будет преобразовывать объект даты в строку формата %Y-%m-%d
